{
    "product": [
        {
            "name": "Дюна 2",
            "type": "Фантастика",
            "year": "2016",
            "categ": "фильм",
            "disc": "Человечество расселилось по далёким планетам, а за власть над обитаемым пространством постоянно борются разные могущественные семьи. В центре противостояния оказывается пустынная планета Арракис. Там обитают гигантские песчаные черви, а в пещерах затаились скитальцы-фремены, но её главная ценность — пряность, самое важное вещество во Вселенной. Тот, кто контролирует Арракис, контролирует пряность, а тот, кто контролирует пряность, контролирует Вселенную.",
            "img": "https://upload.wikimedia.org/wikipedia/ru/f/f1/%D0%94%D1%8E%D0%BD%D0%B0_%D0%BE%D1%84%D0%B8%D1%86%D0%B8%D0%B0%D0%BB%D1%8C%D0%BD%D1%8B%D0%B9_%D0%BF%D0%BE%D1%81%D1%82%D0%B5%D1%80.jpg",
            "film": "https://beggins.allohastream.com/?kp=409424&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 1,
            "comment": []
        },
        {
            "name": "Бэтмен против Супермена",
            "type": "Фантастика",
            "year": "2016",
            "categ": "фильм",
            "comment": [],
            "disc": "Опасаясь, что действия богоподобного супергероя так и останутся бесконтрольными, грозный и могущественный страж Готэм Сити бросает вызов самому почитаемому в наши дни спасителю Метрополиса, в то время как весь остальной мир решает, какой герой ему по-настоящему нужен. И пока Бэтмен и Супермен пребывают в состоянии войны друг с другом, возникает новая угроза, которая ставит человечество под самую большую опасность, с которой оно когда-либо сталкивалось.",
            "img": "https://avatars.mds.yandex.net/get-kinopoisk-image/1704946/42efb255-cc24-4e0f-87b8-773c2f9208b0/600x900",
            "film": "https://beggins.allohastream.com/?kp=770631&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 2
        },
        {
            "name": "Падение Луны",
            "type": "Катастрофа",
            "year": "2022",
            "categ": "фильм",
            "disc": "В 2011 году во время рядового ремонта спутника на находившихся в открытом космосе астронавтов напал странный рой, вылетевший из лунного кратера. Один космонавт погиб, а второй — Брайан Харпер — несколько лет после происшествия пытался убедить НАСА, что в случившемся виноват необъяснимый феномен. 10 лет спустя Луна внезапно сходит с орбиты и идёт на столкновение с Землёй, что провоцирует множественные катаклизмы и грозит гибелью человечества. Астроном-самородок, первым заметивший данную аномалию и считающий, что Луна является мегаструктурой, безуспешно пытается достучаться до правительства, поэтому просит помощи у вышедшего в отставку Харпера.",
            "img": "https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/080648f5-f42f-46cb-81eb-e205f0f4f1bc/600x900",
            "film": "https://beggins.allohastream.com/?kp=988816&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 3,
            "comment": []
        },
        {
            "name": "Бэтмен 2",
            "type": "Боевик",
            "year": "2022",
            "categ": "фильм",
            "comment": [],
            "disc": "После двух лет поисков правосудия на улицах Готэма Бэтмен становится для горожан олицетворением беспощадного возмездия. Когда в городе происходит серия жестоких нападений на высокопоставленных чиновников, улики приводят Брюса Уэйна в самые тёмные закоулки преступного мира, где он встречает Женщину-Кошку, Пингвина, Кармайна Фальконе и Загадочника. Теперь под прицелом оказывается сам Бэтмен, которому предстоит отличить друга от врага и восстановить справедливость во имя Готэма.",
            "img": "https://upload.wikimedia.org/wikipedia/ru/thumb/b/b2/The_Batman_Poster.jpg/404px-The_Batman_Poster.jpg",
            "film": "https://beggins.allohastream.com/?kp=590286&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 4
        },
        {
            "name": "Cимпсоны",
            "type": "Комедия",
            "year": "1989",
            "categ": "сериал",
            "comment": [],
            "disc": "Семейство Симпсонов — папаша Гомер, мама Мардж, дочери Лиза и маленькая Мэгги, и несносный подросток Барт — проживают в среднестатистическом городке Спрингфилд. Гомер трудится на местной атомной станции, Мардж занимается домом и детьми, любознательная Лиза отлично учится в школе, а Барт постоянно попадает во всякие переделки.",
            "img": "https://upload.wikimedia.org/wikipedia/ru/thumb/1/1b/Simpsons.png/274px-Simpsons.png",
            "film": "https://beggins.allohastream.com/?kp=77164&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 5
        },
        {
            "name": "Король Ричард",
            "type": "Биография",
            "year": "2021",
            "categ": "фильм",
            "comment": [],
            "disc": "Ричард Уильямс - отец теннисисток Серены и Винус Уильямс. Сам он практически никогда не играл в теннис и мало понимал в тренировке профессиональных теннисистов. Он планировал тренировать всех дочерей, но настоящий талант показали только Серена и Винус.",
            "img": "https://thumbs.dfs.ivi.ru/storage9/contents/0/a/bd9cef43331b42698c70a7e2032bc6.jpg",
            "film": "https://beggins.allohastream.com/?kp=1272469&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 6
        },
        {
            "name": "Волк с Уолл-стрит",
            "type": "Биография",
            "year": "2013",
            "categ": "фильм",
            "disc": "1987 год. Джордан Белфорт становится брокером в успешном инвестиционном банке. Вскоре банк закрывается после внезапного обвала индекса Доу-Джонса. По совету жены Терезы Джордан устраивается в небольшое заведение, занимающееся мелкими акциями. Его настойчивый стиль общения с клиентами и врождённая харизма быстро даёт свои плоды.",
            "comment": [],
            "img": "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/5c758ac0-7a5c-4f00-a94f-1be680a312fb/600x900",
            "film": "https://beggins.allohastream.com/?kp=462682&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 7
        },
        {
            "name": "Стив Джобс",
            "type": "Биография",
            "year": "2015",
            "categ": "фильм",
            "comment": [],
            "disc": "Он создавал прорывные продукты и сжигал мосты. Байопик о закулисье жизни гения от сценариста «Социальной сети»",
            "img": "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/82c9836a-fe69-486a-b219-9f0761fd6495/600x900",
            "film": "https://beggins.allohastream.com/?kp=634679&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 8
        },
        {
            "name": "Социальная сеть",
            "type": "Биография",
            "year": "2010",
            "categ": "фильм",
            "comment": [],
            "disc": "В фильме рассказывается история создания одной из самых популярных в Интернете социальных сетей - Facebook. Оглушительный успех этой сети среди пользователей по всему миру навсегда изменил жизнь студентов-однокурсников гарвардского университета, которые основали ее в 2004 году и за несколько лет стали самыми молодыми мультимиллионерами в США.",
            "img": "https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/04c60e22-8972-48a0-8945-019222065ae2/600x900",
            "film": "https://beggins.allohastream.com/?kp=427198&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 9
        },
        {
            "name": "Гринч",
            "type": "Комедия",
            "year": "2018",
            "categ": "мультфильм",
            "disc": "Любой бы на месте Гринча позеленел и взбесился. Как порядочный интроверт он живёт в тёмной пещере на самой вершине горы подальше ото всех, но эти «все» готовят грандиознейшее празднование нового года. Они шумят, всё украшают и дико бесят. Кто бы отказал себе в удовольствии испортить праздник? Гринч решает украсть Новый год. © ГидОнлайн",
            "comment": [],
            "img": "https://gidonline-film.ru/uploads/posts/2021-07/480.jpg",
            "film": "https://beggins.allohastream.com/?kp=738499&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 10
        },
        {
            "name": "Сад изящных слов",
            "type": "Драма",
            "year": "2013",
            "categ": "аниме",
            "comment": [],
            "disc": "Юноша по имени Такао встречает таинственную молодую женщину. Их случайные и как будто ни к чему не ведущие встречи в парке, где Такао прогуливает занятия, работая над достижением своей странной мечты — посвятить жизнь конструированию и изготовлению обуви — повторяются снова и снова, правда, только в ненастные дни. Сердца молодых людей начинают приоткрываться друг другу, но на это нужно время, а впереди уже маячит конец сезона дождей.",
            "img": "https://avatars.mds.yandex.net/get-kinopoisk-image/1777765/230baaf8-9e08-4125-adf4-0b16fab8f221/600x900",
            "film": "https://beggins.allohastream.com/?kp=730665&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 11
        },
        {
            "name": "Тайная жизнь домашних животных",
            "type": "Комедия",
            "categ": "мультфильм",
            "year": "2016",
            "comment": [],
            "disc": "Что делают домашние животные, пока хозяева пропадают на работе? С тоской смотрят в окно? Смиренно дремлют на коврике у двери? Как бы не так. Они ведут свою тайную жизнь.",
            "img": "https://avatars.mds.yandex.net/get-kinopoisk-image/1600647/2af3423b-054e-4359-b9a7-ed36c163214a/600x900",
            "film": "https://beggins.allohastream.com/?kp=743088&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 12
        },
        {
            "name": "Планета 51",
            "type": "Комедия",
            "categ": "мультфильм",
            "year": "2009",
            "comment": [
                {
                    "userName": "timurshermamatov1@gmail.com",
                    "comment": "superklassno",
                    "time": "16:10:45",
                    "date": "06.12.2022",
                    "id": "2022-12-06T10:11:01.993Z"
                }
            ],
            "disc": "Где-то очень далеко существует мир, где жизнь легка, а его жители абсолютно беззаботны, да и все вообще там прекрасно. Этим местом является планета 51. В один день даже здесь появляется космический корабль с инопланетных земель, после чего все меняется.",
            "img": "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/9c62f6c4-ae95-4087-b6ad-0403238fd016/600x900",
            "film": "https://beggins.allohastream.com/?kp=279221&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 13
        },
        {
            "name": "Самурай Джек",
            "type": "Драма",
            "year": "2001",
            "categ": "сериал",
            "comment": [],
            "disc": "Злой волшебник Аку закинул великого воина древности самурая по имени Джек в далёкое будущее. Дисциплина и верность кодексу самурая делают Джека героем жителей нового времени. К тому же он единственный воин, который может предотвратить порабощение мира злодеем Аку.",
            "img": "https://avatars.mds.yandex.net/get-kinopoisk-image/1600647/4890fc41-ca74-41dc-b637-12b823793f55/600x900",
            "film": "https://beggins.allohastream.com/?kp=295050&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 14
        },
        {
            "name": "Кубо. Легенда о самурае",
            "type": "Комедия",
            "year": "2016",
            "categ": "мультфильм",
            "comment": [],
            "disc": "Кубо - наследник великого рода, но когда возвратились духи прошлого, жаждущие мести, на его защиту отважилась встать лишь странная парочка хранителей. И теперь для Кубо единственный шанс на спасение – найти магические доспехи отца, легендарного самурая.",
            "img": "https://avatars.mds.yandex.net/get-kinopoisk-image/1629390/2da172bb-44ad-4b10-9d4e-2ad430c4cd24/600x900",
            "film": "https://beggins.allohastream.com/?kp=882290&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 15
        },
        {
            "name": "Чёрный Адам",
            "type": "Фантастика",
            "year": "2022",
            "comment": [],
            "categ": "фильм",
            "disc": "Фантастический боевик «Чёрный Адам» основан на одноименном персонаже издательства DC Comics и рассказывает историю происхождения и становления антигероя, злодея Черного Адама. Пять тысяч лет назад Тет Адам был простым рабом, но после своей насильственной смерти он переродился божеством, получив все силы египетских богов, которые сделали его могущественным. Однако его быстро упекли в тюрьму, дабы он не успел воспользоваться своими силами. В современном мире Черный Адам освобождается имея всего два варианта — стать супергероем или суперзлодеем. ",
            "img": "https://kinogo.zone/uploads/posts/2022-10/1666331627_black-adam-2022-movie.jpg",
            "film": "https://beggins.allohastream.com/?kp=1009017&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 16
        },
        {
            "name": "Стражи Галактики: Праздничный спецвыпуск",
            "type": "Фантастика",
            "year": "2022",
            "comment": [],
            "categ": "фильм",
            "disc": "Фантастический фильм «Стражи Галактики: Праздничный спецвыпуск» приурочен к грядущим рождественским и новогодним праздникам и рассказывает о приключениях полюбившейся команды супергероев: Звёздного Лорда, Ракеты, Грута, Дракса Разрушителя, Небулы и Мантис. Переживая из-за разрыва с Гаморой Питер Квилл впадает в депрессию. Друзья не могут видеть его страдания и решают помочь парню, сделав для него идеальный подарок на Рождество. Для этого им придется отправиться на Землю и разыскать любимого актера Питера — Кевина Бейкона, который конечно же не готов к встрече с инопланетянами с других галактик.  ",
            "img": "https://kinozapas.co/uploads/posts/2022-11/1669454566_strazhi-galaktiki.jpg",
            "film": "https://beggins.allohastream.com/?kp=4295653&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 17
        },
        {
            "name": "Миньоны: Грювитация",
            "type": "Комедия",
            "year": "2022",
            "comment": [],
            "categ": "мультфильм",
            "disc": "Грювитация является приквелом франшизы «Гадкий я» и рассказывает о долгожданной встрече маленьких забавных существ со своим юным, ужасным и коварным предводителем Грю. Сюжет мультфильма разворачивается в 1970-е годы, когда гадкий мальчишка Грю всеми способами старается стать суперзлодеем. Для этого он отправляется на собеседование в ряды тайной злодейской организации, где Грю предстоит продемонстрировать все свои самые отвратительные навыки. Однако на пути к званию самого коварного и гадкого злодея Грю и его подопечным миньонам предстоит пережить очень много забавных приключений.",
            "img": "https://static.kinoafisha.info/k/movie_posters/canvas/800x1200/upload/movie_posters/4/1/1/8329114/62dac697b11bcf692bf360d08389e487.jpg",
            "film": "https://beggins.allohastream.com/?kp=1009513&token=ec8eb991b7936a323cb3fc8f493db6",
            "id": 18
        },
        {
            "name": "Человек-паук: Через вселенные",
            "type": "Фантастика",
            "year": "2018",
            "disc": "Мы всё знаем о Питере Паркере. Он спас город, влюбился, а потом спасал город снова и снова... Но все это - в нашем измерении. А что если в результате работы гигантского коллайдера откроется окно из одного измерения в другое? Найдется ли в нем свой Человек-паук? И как он будет выглядеть? Приготовьтесь к тому, что в разных вселенных могут быть разные Люди-пауки и однажды им придется собраться вместе для борьбы с почти непобедимым врагом",
            "img": "https://www.kinonews.ru/insimgs/2018/poster/poster81595_1.jpg",
            "film": "https://beggins.allohastream.com/?kp=920265&token=ec8eb991b7936a323cb3fc8f493db6",
            "comment": [],
            "categ": "мультфильм",
            "id": 19
        },
        {
            "name": " Суперсемейка 2",
            "type": "Фантастика",
            "year": "2018",
            "disc": "После событий первой части суперсемейка пользуется повышенным вниманием со стороны журналистов. Неожиданно оказалось, что обаятельная Миссис Исключительная гораздо лучше смотрится на экране телевизора, чем её муж. Мистеру Исключительному все чаще приходится сидеть дома и приглядывать за детьми, у каждого из которых есть свои причины быть недовольным собственными суперспособностями. Однако семейным проблемам предстоит отступить на второй план, когда окажется, что спокойствию Суперсемейки угрожает новый могущественный враг.",
            "img": "https://kinogo.zone/uploads/posts/2019-06/1560421852-368004466-supersemeyka-2.jpg",
            "film": "https://beggins.allohastream.com/?kp=839650&token=ec8eb991b7936a323cb3fc8f493db6",
            "comment": [],
            "categ": "мультфильм",
            "id": 20
        },
        {
            "name": "Семейка Аддамс",
            "type": "Комедия",
            "year": "2019",
            "disc": "Папа любит долгие прогулки в ненастную погоду. Мама считает, что черный цвет самый яркий. У детей кладбище - любимая площадка для игр. Бабушка выпивает пару капель яда перед сном. Вы все еще думаете, что ваши родственники странные? Знакомьтесь - семейка Аддамс",
            "img": "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/8b31b145-4f86-4888-8ebe-7632ad744a7e/300x450",
            "film": "https://beggins.allohastream.com/?kp=505841&token=ec8eb991b7936a323cb3fc8f493db6",
            "comment": [],
            "categ": "мультфильм",
            "id": 21
        },
        {
            "name": "Суперсемейка",
            "type": "Фантастика",
            "year": "2004",
            "disc": "История семьи супергероев, члены которой уже отошли от больших дел и предпочитают жить непримечательной жизнью обычных землян. Они обладают сверхъестественными способностями и относительно легко справлялись с мировым злом.  Но в один прекрасный день папаше и его домочадцам приходится вновь облачиться в прорезиненные костюмы супергероев (а для этого нужно срочно сбросить лишние килограммы) и в очередной раз спасти человечество от таинственного злодея",
            "img": "https://thumbs.dfs.ivi.ru/storage4/contents/b/e/fb73745fc3f8765ed8e96660329498.jpg",
            "film": "https://beggins.allohastream.com/?kp=38903&token=ec8eb991b7936a323cb3fc8f493db6",
            "comment": [],
            "categ": "мультфильм",
            "id": 22
        },
        {
            "name": "Уэнсдэй",
            "type": "лсьс",
            "year": "2323",
            "disc": "асавсваыававвав выа ыва ",
            "img": "https://img-24x7.com/uploads/82/4365427.jpg",
            "film": "https://gdfgsd.ffn2j2jyr7b7uc44uk.buzz/?token=4cd98e08f1e1f0273692e35b16b690&kp=4365427",
            "comment": [],
            "categ": "фильм",
            "id": 23
        }
    ]
}
