import React from "react";
import "./AboutUs.css";

const AboutUs = () => {
  return (
    <div className="about-us">
      <div className="div1">
        <h4>
          ugolek.tv — это все, что ты смотришь и даже больше. Тебя ждет самый
          широкий выбор сериалов, фильмов и развлекательных шоу для всей семьи,
          весь контент главных фильмовы в одном месте и совершенно бесплатно.
          Начни просмотр дома на сайте. Открывай каждый день ugolek.tv
        </h4>
        <h4>
          Оформи подписку, чтобы получить еще больше уникального контента.
        </h4>
        <h4>Подписка ugolek .tv – это:</h4>
        <h4>
          – Собственные сериалы и шоу, выходящие под брендом ugolek originals
        </h4>
        <h4>– Эксклюзивные зарубежные премьеры одновременно со всем миром</h4>
        <h4>
          – Хиты мирового кино и любимая телевизионная классика без рекламы
        </h4>
      </div>
    </div>
  );
};

export default AboutUs;
